package by.epam.introduction_to_java.basic.modul05.Task03;



/*
Задача 3.
Создать класс Календарь с внутренним классом, с помощью объектов которого можно хранить информацию о
выходных и праздничных днях.
 */
public class Main {


    public static void main(String[] args) {
        Calendar calendar = new Calendar();
        System.out.println(calendar.getTime());
    }
}
