package by.epam.introduction_to_java.basic.modul04.simple_object_and_class.Task10.Model;

public class SukhoiSuperJet100 extends PassangerPlane{
    /*
    Основные характеристики самолета Сухой Суперджет-100

 	SSJ-95	SSJ-95LR
Размеры
Длина (м)	29.8	29.8
Размах крыльев (м)	27.8	27.8
Высота (м)	10.3	10.3
Вес
Макс. взлетный вес (кг)	42 500	45 900
Макс. посадочный вес (кг)	39 400	39 400
Макс. коммерческая загрузка (кг)	12 250	12 250
Пассажирский салон
Кол-во кресел (эконом)	95-98	95-98
Шаг кресел эконом класса (см)	81.3	81.3
Ширина салона (м)	3.2	3.2

     */
}
